app/controllers/posts_controller.rb

  def show
    @post = Post.find_by(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE (1) LIMIT ?  [["LIMIT", 1]]